PayPalAPISoapBinding.ExecuteCheckoutOperations.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:ExecuteCheckoutOperationsReq>
    <ns1:ExecuteCheckoutOperationsRequest>
     <ns3:ExecuteCheckoutOperationsRequestDetails>
      <ns3:Token></ns3:Token>
      <ns3:SetDataRequest>
       <ns3:BillingApprovalDetails>
        <ns3:ApprovalType>BillingAgreement</ns3:ApprovalType>
       </ns3:BillingApprovalDetails>
       <ns3:BillingApprovalDetails>
        <ns3:ApprovalType>BillingAgreement</ns3:ApprovalType>
       </ns3:BillingApprovalDetails>
       <ns3:BuyerDetail>
       </ns3:BuyerDetail>
       <ns3:InfoSharingDirectives>
       </ns3:InfoSharingDirectives>
       <ns3:RetrieveShippingAddress>false</ns3:RetrieveShippingAddress>
       <ns3:UserChannel>WEB</ns3:UserChannel>
       <ns3:ReqConfirmShipping>false</ns3:ReqConfirmShipping>
       <ns3:PaymentDetails>
       </ns3:PaymentDetails>
       <ns3:PaymentDetails>
       </ns3:PaymentDetails>
       <ns3:ExternalPartnerTrackingDetails>
       </ns3:ExternalPartnerTrackingDetails>
       <ns3:URI></ns3:URI>
      </ns3:SetDataRequest>
      <ns3:AuthorizationRequest>
       <ns3:IsRequested>false</ns3:IsRequested>
      </ns3:AuthorizationRequest>
     </ns3:ExecuteCheckoutOperationsRequestDetails>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:ExecuteCheckoutOperationsRequest>
   </ns1:ExecuteCheckoutOperationsReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
